{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "4"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/feed_back/lstm_cell/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/MatMul_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/feed_back/dense/MatMul_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/feed_back/dense/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "4"}]}}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/feed_back/rnn/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/feed_back/rnn/Shape", "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack", "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack_1", "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/feed_back/rnn/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/feed_back/rnn/transpose", "StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/feed_back/rnn/strided_slice", "StatefulPartitionedCall/feed_back/rnn/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/feed_back/rnn/strided_slice", "StatefulPartitionedCall/feed_back/rnn/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/feed_back/rnn/Shape_1", "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack", "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack_1", "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/feed_back/rnn/zeros_1/packed", "StatefulPartitionedCall/feed_back/rnn/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/feed_back/rnn/zeros/packed", "StatefulPartitionedCall/feed_back/rnn/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/feed_back/rnn/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21", "op": "NoOp", "input": ["^StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1", "^StatefulPartitionedCall/feed_back/rnn/zeros_1", "^StatefulPartitionedCall/feed_back/rnn/zeros", "^StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor"]}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_12", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/time", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/zeros_1", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/strided_slice_1", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_10", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/while/loop_counter", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_11", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/while/maximum_iterations", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/zeros", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_18", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_19", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/enter/_20", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/feed_back/rnn/while/LoopControlInputs/_21"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZmVlZF9iYWNrL3Jubi93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_24", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_12", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_51"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_15", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_54"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_13", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_52"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_16", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_55"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_22", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_10", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_49"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_23", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_11", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_50"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_14", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_53"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/feed_back/rnn/while/enter/_17", "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_56"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/cond/_8/feed_back/rnn/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_24", "StatefulPartitionedCall/feed_back/rnn/while/merge/_28", "^StatefulPartitionedCall/feed_back/rnn/while/merge/_29", "^StatefulPartitionedCall/feed_back/rnn/while/enter/_18", "^StatefulPartitionedCall/feed_back/rnn/while/enter/_19", "^StatefulPartitionedCall/feed_back/rnn/while/enter/_20", "^StatefulPartitionedCall/feed_back/rnn/while/merge/_22", "^StatefulPartitionedCall/feed_back/rnn/while/merge/_23", "^StatefulPartitionedCall/feed_back/rnn/while/merge/_25", "^StatefulPartitionedCall/feed_back/rnn/while/merge/_26", "^StatefulPartitionedCall/feed_back/rnn/while/merge/_27"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30", "op": "LoopCond", "input": ["StatefulPartitionedCall/feed_back/rnn/while/cond/_8/feed_back/rnn/while/Less"]}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_25", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/strided_slice_1_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_28", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/loop_counter_switch/_31", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_22", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/maximum_iterations_switch/_32", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_23", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_1_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_27", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_29", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_26", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/time_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/feed_back/rnn/while/merge/_24", "StatefulPartitionedCall/feed_back/rnn/while/LoopCond/_30"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1_switch/_34"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/strided_slice_1_switch/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_40", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/loop_counter_switch/_31"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/loop_body_control/_39", "op": "Identity", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/loop_counter_switch/_31:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_41", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/maximum_iterations_switch/_32"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_1_switch/_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor_switch/_38"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_switch/_35"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/exit/_42", "op": "Exit", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/time_switch/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/feed_back/rnn/while/exit/_43", "StatefulPartitionedCall/feed_back/rnn/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70", "op": "NoOp", "input": ["^StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor_switch/_38", "^StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1_switch/_34", "^StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/strided_slice_1_switch/_37", "^StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/time_switch/_33", "^StatefulPartitionedCall/feed_back/rnn/while/loop_body_control/_39", "^StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/maximum_iterations_switch/_32", "^StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_1_switch/_36", "^StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_switch/_35", "^StatefulPartitionedCall/feed_back/rnn/while/enter/_18", "^StatefulPartitionedCall/feed_back/rnn/while/enter/_19", "^StatefulPartitionedCall/feed_back/rnn/while/enter/_20"]}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/feed_back/rnn/while/exit/_44", "StatefulPartitionedCall/feed_back/lstm_cell/MatMul_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/feed_back/rnn/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack", "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack_1", "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input/_73", "op": "Identity", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/time_switch/_33:1", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/feed_back/rnn/while/enter/_18", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/feed_back/rnn/while/enter/_19", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/feed_back/rnn/while/enter/_20", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/feed_back/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/feed_back/rnn/strided_slice_3", "StatefulPartitionedCall/feed_back/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/feed_back/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/loop_counter_switch/_31:1", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input/_73", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor_switch/_38:1", "Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input/_73", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_switch/_35:1", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93", "op": "NoOp", "input": ["^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/feed_back/dense/BiasAdd", "StatefulPartitionedCall/feed_back/lstm_cell/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/strided_slice_1_switch/_37:1", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor_switch/_38:1", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_51", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1/ReadVariableOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_49", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add_1", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1/ReadVariableOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_50", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/while/maximum_iterations_switch/_32:1", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1/ReadVariableOp", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input_control_node/_70"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/add", "op": "AddV2", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/MatMul", "StatefulPartitionedCall/feed_back/lstm_cell/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/add", "op": "AddV2", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/add", "StatefulPartitionedCall/feed_back/lstm_cell/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/add", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/split", "op": "Split", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/split/split_dim", "StatefulPartitionedCall/feed_back/lstm_cell/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split", "op": "Split", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split/split_dim", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/mul", "op": "Mul", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/Sigmoid_1", "StatefulPartitionedCall/feed_back/rnn/while/exit/_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/Sigmoid", "StatefulPartitionedCall/feed_back/lstm_cell/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/mul", "op": "Mul", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Sigmoid_1", "StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/zeros_1_switch/_36:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Sigmoid", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/mul", "StatefulPartitionedCall/feed_back/lstm_cell/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/mul", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_54", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/add_1", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/Sigmoid_2", "StatefulPartitionedCall/feed_back/lstm_cell/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Sigmoid_2", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/dense/BiasAdd_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/feed_back/lstm_cell/mul_2", "StatefulPartitionedCall/feed_back/dense/MatMul_1/ReadVariableOp", "StatefulPartitionedCall/feed_back/dense/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/feed_back/rnn/while/StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1_switch/_34:1", "Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/input/_73", "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/mul_2", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/feed_back/stack", "op": "Pack", "input": ["StatefulPartitionedCall/feed_back/dense/BiasAdd", "StatefulPartitionedCall/feed_back/dense/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/next_iteration/_52", "op": "NextIteration", "input": ["StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/feed_back/rnn/while/body/_9/output_control_node/_93"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/feed_back/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/feed_back/stack", "StatefulPartitionedCall/feed_back/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/feed_back/transpose", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_43", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_45", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_46", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_47", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_44", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_40", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_41", "^StatefulPartitionedCall/feed_back/rnn/while/exit/_42"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/feed_back/lstm_cell/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/dense/MatMul/ReadVariableOp", "shape": [32, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/dense/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/MatMul/ReadVariableOp", "shape": [4, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/MatMul_1/ReadVariableOp", "shape": [32, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/lstm_cell/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/dense/MatMul_1/ReadVariableOp", "shape": [32, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/dense/BiasAdd_1/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/maximum_iterations", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_1", "shape": [4, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [32, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/add_1/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul/ReadVariableOp", "shape": [4, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/MatMul_1/ReadVariableOp", "shape": [32, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/feed_back/rnn/while/body/_9/feed_back/rnn/while/lstm_cell/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}]}]}